cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1233H6PGE.svd
        <register>
          <name>DCCMP0</name>
          <description>ADC Digital Comparator Range 0</description>
          <addressOffset>0x00000E40</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP0_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP0_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP1</name>
          <description>ADC Digital Comparator Range 1</description>
          <addressOffset>0x00000E44</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP1_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP1_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP2</name>
          <description>ADC Digital Comparator Range 2</description>
          <addressOffset>0x00000E48</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP2_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP2_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP3</name>
          <description>ADC Digital Comparator Range 3</description>
          <addressOffset>0x00000E4C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP3_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP3_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP4</name>
          <description>ADC Digital Comparator Range 4</description>
          <addressOffset>0x00000E50</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP4_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP4_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP5</name>
          <description>ADC Digital Comparator Range 5</description>
          <addressOffset>0x00000E54</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP5_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP5_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP6</name>
          <description>ADC Digital Comparator Range 6</description>
          <addressOffset>0x00000E58</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP6_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP6_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP7</name>
          <description>ADC Digital Comparator Range 7</description>
          <addressOffset>0x00000E5C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP7_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP7_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>ADC Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>ADC_PP_MSR</name>
              <description>Maximum ADC Sample Rate</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PP_MSR_125K</name>
                  <description>125 ksps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PP_MSR_250K</name>
                  <description>250 ksps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PP_MSR_500K</name>
                  <description>500 ksps</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PP_MSR_1M</name>
                  <description>1 Msps</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_PP_CH</name>
              <description>ADC Channel Count</description>
              <bitRange>[9:4]</bitRange>
            </field>
            <field>
              <name>ADC_PP_DC</name>
              <description>Digital Comparator Count</description>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>ADC_PP_TYPE</name>
              <description>ADC Architecture</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PP_TYPE_SAR</name>
                  <description>SAR</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_PP_RSL</name>
              <description>Resolution</description>
              <bitRange>[22:18]</bitRange>
            </field>
            <field>
              <name>ADC_PP_TS</name>
              <description>Temperature Sensor</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <description>ADC Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <fields>
            <field>
              <name>ADC_PC_SR</name>
              <description>ADC Sample Rate</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PC_SR_125K</name>
                  <description>125 ksps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_SR_250K</name>
                  <description>250 ksps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_SR_500K</name>
                  <description>500 ksps</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_SR_1M</name>
                  <description>1 Msps</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>CC</name>
          <description>ADC Clock Configuration</description>
          <addressOffset>0x00000FC8</addressOffset>
          <fields>
            <field>
              <name>ADC_CC_CS</name>
              <description>ADC Clock Source</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_CC_CS_SYSPLL</name>
                  <description>Either the system clock (if the PLL bypass is in effect) or the 16 MHz clock derived from PLL / 25 (default)</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_CC_CS_PIOSC</name>
                  <description>PIOSC</description>
                  <value>0x1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
